<?php
//письмо юзеру после 20 дней отсутствия
?>

<div>
    Здравствуйте!<br/>
    Напоминаем, что Вы участвуете в проекте «Семьи Леруа Мерлен». <br/>
    В нашем сообществе мы исследуем ремонт, помогаем советами и узнаем новые идеи.
    За Ваши ремонтные истории Вы получаете баллы, которые затем меняете на товары в магазине Леруа Мерлен.<br/>
    Заходите по ссылке и делитесь с нами новостями <a href="http://families.leroymerlin.ru/">http://families.leroymerlin.ru/</a>
</div>
<br/>
<div>
    Ждем Вас!<br/>
    Команда Леруа Мерлен
</div>
