<?php

use yii\db\Migration;

class m200219_015713_update_shops extends Migration
{
    public function safeUp()
    {
		$shops = [
			['002', 'Мытищи', 'Москва'],
			['003', 'Красногорск', 'Москва'],
			['004', 'Алтуфьево', 'Москва'],
			['007', 'Ростов-1', 'Ростов-на-Дону'],
			['008', 'Краснодар', 'Краснодар'],
			['010', 'Коллонтай', 'Санкт-Петербург'],
			['009', 'Самара-1', 'Самара'],
			['012', 'Новосибирск-1', 'Новосибирск'],
			['006', 'Сокольники', 'Москва'],
			['011', 'Испытателей', 'Санкт-Петербург'],
			['147', 'Адыгея', 'Краснодар'],
			['014', 'Ростов-2', 'Ростов-на-Дону'],
			['016', 'Омск-1', 'Омск'],
			['020', 'Лефортово', 'Москва'],
			['021', 'Воронеж', 'Воронеж'],
			['022', 'Климовск', 'Московская область'],
			['005', 'Химки', 'Москва'],
			['017', 'Уфа-1', 'Уфа'],
			['023', 'Красноярск-1', 'Красноярск'],
			['013', 'Самара-2', 'Самара'],
			['026', 'Рязанский проспект', 'Москва'],
			['025', 'Екатеринбург', 'Екатеринбург'],
			['018', 'Тверь', 'Тверь'],
			['024', 'Волгоград', 'Волгоград'],
			['019', 'Рязань', 'Рязань'],
			['028', 'Ногинск', 'Московская область'],
			['027', 'Казань-1', 'Казань'],
			['031', 'Тюмень-1', 'Тюмень'],
			['032', 'Новая Рига', 'Москва'],
			['030', 'Новосибирск-2', 'Новосибирск'],
			['037', 'Красноярск-2', 'Красноярск'],
			['033', 'Уфа-2', 'Уфа'],
			['034', 'Самара-3', 'Самара'],
			['035', 'Зеленоград', 'Московская область'],
			['036', 'Барнаул-1', 'Барнаул'],
			['041', 'Бугры', 'Санкт-Петербург'],
			['038', 'Челябинск', 'Челябинск'],
			['040', 'Шолохово', 'Московская область'],
			['039', 'Набережные Челны', 'Набережные Челны'],
			['047', 'Тула', 'Тула'],
			['048', 'Пенза', 'Пенза'],
			['056', 'Юдино', 'Москва'],
			['046', 'Казань-2', 'Казань'],
			['052', 'Ярославль Вернисаж', 'Ярославль'],
			['055', 'Кемерово', 'Кемерово'],
			['044', 'Новокузнецк', 'Новокузнецк'],
			['043', 'Вегас', 'Москва'],
			['042', 'Партизана Германа', 'Санкт-Петербург'],
			['045', 'Косино', 'Москва'],
			['071', 'Ульяновск', 'Ульяновск'],
			['059', 'Кострома', 'Кострома'],
			['049', 'Люберцы', 'Московская область'],
			['058', 'Ярославль Бор', 'Ярославль'],
			['065', 'Пушкино', 'Московская область'],
			['070', 'Волжский', 'Волжский'],
			['077', 'Киров', 'Киров'],
			['057', 'Саратов', 'Саратов'],
			['067', 'Новосибирск-3', 'Новосибирск'],
			['080', 'Тольятти', 'Тольятти'],
			['089', 'Барнаул-2', 'Барнаул'],
			['081', 'Хабаровск', 'Хабаровск'],
			['051', 'Киевское шоссе', 'Москва'],
			['082', 'Красноярск-3', 'Красноярск'],
			['069', 'Ставрополь', 'Ставрополь'],
			['074', 'Оренбург', 'Оренбург'],
			['088', 'Омск-2', 'Омск'],
			['079', 'Петрозаводск', 'Петрозаводск'],
			['068', 'Иркутск', 'Иркутск'],
			['083', 'Архангельск', 'Архангельск'],
			['111', 'Воронеж-2', 'Воронеж'],
			['078', 'Калининград', 'Калининград'],
			['073', 'Курск', 'Курск'],
			['086', 'Троицк', 'Московская область'],
			['110', 'Тюмень-2', 'Тюмень'],
			['109', 'Пермь', 'Пермь'],
			['122', 'Истра', 'Московская область'],
			['127', 'Саранск', 'Саранск'],
			['091', 'Череповец', 'Череповец'],
			['114', 'Домодедово', 'Московская область'],
			['119', 'Нижний Новгород', 'Нижний Новгород'],
			['136', 'Петергофское шоссе', 'Санкт-Петербург'],
			['137', 'Таллинское шоссе', 'Санкт-Петербург'],
			['141', 'Руставели', 'Санкт-Петербург'],
			['143', 'Варшавское шоссе', 'Москва'],
			['134', 'Парашютная', 'Санкт-Петербург'],
			['135', 'Московское шоссе', 'Санкт-Петербург'],
			['142', 'Калуга', 'Калуга'],
			['053', 'Екатеринбург 2', 'Екатеринбург'],
			['140', 'Выборгское', 'Санкт-Петербург'],
			['115', 'Ижевск', 'Ижевск'],
			['138', 'Уральская', 'Санкт-Петербург'],
			['094', 'Ростов-3', 'Ростов-на-Дону'],
			['128', 'Кемерово-2', 'Кемерово'],
			['117', 'ЗИЛ', 'Москва'],
			['075', 'Владивосток', 'Артём'],
			['153', 'Жуковский', 'Московская область'],
			['092', 'Западный Обход', 'Краснодар'],
			['165', 'Новороссийск', 'Новороссийск'],
			['054', 'Иваново', 'Иваново'],
			['150', 'Владикавказ', 'Владикавказ'],
			['163', 'Казань-3', 'Казань'],
			['126', 'Клин', 'Московская область'],
			['090', 'Белгород', 'Белгород'],
			['029', 'Беседы', 'Московская область'],
			['064', 'Видное', 'Московская область'],
			['724', 'Владимир', 'Владимир'],
			['158', 'Вологда', 'Вологда'],
			['390', 'Заречье', 'Московская область'],
			['760', 'Магнитогорск', 'Магнитогорск'],
			['235', 'Марфино', 'Московская область'],
			['118', 'Наро-Фоминск', 'Наро-Фоминск'],
			['758', 'Новокузнецк-2', 'Новокузнецк'],
			['124', 'Новосибирск-4', 'Новосибирск'],
			['156', 'Псков', 'Псков'],
			['181', 'Смоленск Кутузова', 'Смоленск'],
			['120', 'Улан-Удэ', 'Улан-Удэ'],
			['123', 'Хабаровск-2', 'Хабаровск'],
			['116', 'Чебоксары', 'Чебоксары'],
			['780', 'Щелково', 'Московская область'],
		];

		foreach ($shops as $shop) {
			$_shop = (new \yii\db\Query())->select('*')->from('{{%shop}}')->where(['number' => $shop[0]])->one();
			if ($_shop === false) {
				$cityId = (new \yii\db\Query())->select('id')->from('{{%city}}')->where(['name' => $shop[2]])->scalar();
				if ($cityId === false) {
					throw new \yii\db\Exception('City not found: ' . $shop[0]);
				}
				$this->insert('{{%shop}}', ['city_id' => $cityId, 'number' => $shop[0], 'name' => $shop[1]]);
			}
			else {
				$this->update('{{%shop}}', ['name' => $shop[1]], ['id' => $_shop['id']]);
			}
		}

		return true;
    }

    public function safeDown()
    {
        return true;
    }
}
